In [1]:
import pandas as pd
import numpy as np

In [2]:
data=pd.read_csv('test.csv')

In [3]:
data.head()

    A     B     C     D
0  10  20.0  30.0  40.0
1   1   2.0   NaN   4.0
2   5   NaN   7.0   8.0
3   0   9.0  10.0   NaN

In [4]:
data.tail()

    A     B     C     D
0  10  20.0  30.0  40.0
1   1   2.0   NaN   4.0
2   5   NaN   7.0   8.0
3   0   9.0  10.0   NaN

In [5]:
type(data.values[0][2])

numpy.float64

In [6]:
data.isnull().sum()

A    0
B    1
C    1
D    1
dtype: int64

In [7]:
data.isnull()

       A      B      C      D
0  False  False  False  False
1  False  False   True  False
2  False   True  False  False
3  False  False  False   True

In [16]:
from io import StringIO

In [17]:
csv_data="""A,B,C,d
            1,2,3,
            5,6,,7
            8,9,,"""

In [18]:
df1=pd.read_csv(StringIO(csv_data))

In [19]:
df1

   A  B    C    d
0  1  2  3.0  NaN
1  5  6  NaN  7.0
2  8  9  NaN  NaN

In [36]:
#dealing with missing values

In [24]:
data2="""A,B,C,D
         10,20,30,40
         1.0,2.0
         5.0,6.0,,8.0
         0.0,11.0,12.0"""

In [25]:
df2=pd.read_csv(StringIO(data2))

In [26]:
df2

      A     B     C     D
0  10.0  20.0  30.0  40.0
1   1.0   2.0   NaN   NaN
2   5.0   6.0   NaN   8.0
3   0.0  11.0  12.0   NaN

In [27]:
df2.dropna()

      A     B     C     D
0  10.0  20.0  30.0  40.0

In [28]:
df2.dropna(axis=1)

      A     B
0  10.0  20.0
1   1.0   2.0
2   5.0   6.0
3   0.0  11.0

In [29]:
df2.dropna(how='all')

      A     B     C     D
0  10.0  20.0  30.0  40.0
1   1.0   2.0   NaN   NaN
2   5.0   6.0   NaN   8.0
3   0.0  11.0  12.0   NaN

In [30]:
df2.dropna(thresh=3)

      A     B     C     D
0  10.0  20.0  30.0  40.0
2   5.0   6.0   NaN   8.0
3   0.0  11.0  12.0   NaN

In [31]:
df2.dropna(subset=['C'],axis=0)

      A     B     C     D
0  10.0  20.0  30.0  40.0
3   0.0  11.0  12.0   NaN

In [32]:
df2.fillna(value=df2.mean())

      A     B     C     D
0  10.0  20.0  30.0  40.0
1   1.0   2.0  21.0  24.0
2   5.0   6.0  21.0   8.0
3   0.0  11.0  12.0  24.0

In [33]:
df2.fillna(value=df2.median())

      A     B     C     D
0  10.0  20.0  30.0  40.0
1   1.0   2.0  21.0  24.0
2   5.0   6.0  21.0   8.0
3   0.0  11.0  12.0  24.0

In [34]:
from sklearn.preprocessing import Imputer

In [35]:
imr=Imputer(missing_values=np.nan,strategy='median')
imr=imr.fit(df2)

C:\Users\Swaraj Badhei\Anaconda3\lib\site-packages\sklearn\utils\deprecation.py:66: DeprecationWarning: Class Imputer is deprecated; Imputer was deprecated in version 0.20 and will be removed in 0.22. Import impute.SimpleImputer from sklearn instead.
  warnings.warn(msg, category=DeprecationWarning)

In [36]:
imr.transform(df2)

array([[10., 20., 30., 40.],
       [ 1.,  2., 21., 24.],
       [ 5.,  6., 21.,  8.],
       [ 0., 11., 12., 24.]])

In [39]:
#categorical data

In [40]:
from sklearn.preprocessing import LabelEncoder,OneHotEncoder

In [41]:
dt="""color,size,price,class_label
         Red,L,15.1,Class1
         Green,XL,20,Class2
         Blue,S,12.34,Class2
         Red,M,13,Class1"""

In [42]:
data3=pd.read_csv(StringIO(dt))

In [43]:
data3

            color size  price class_label
0             Red    L  15.10      Class1
1           Green   XL  20.00      Class2
2            Blue    S  12.34      Class2
3             Red    M  13.00      Class1

In [44]:
le=LabelEncoder()
le.fit(data3['class_label'])

LabelEncoder()

In [45]:
le.classes_

array(['Class1', 'Class2'], dtype=object)

In [46]:
ohe=OneHotEncoder(categories='auto')

In [47]:
ohe.fit_transform(data3['class_label'].values.reshape(-1,1)).todense()

matrix([[1., 0.],
        [0., 1.],
        [0., 1.],
        [1., 0.]])

In [123]:
#solution Ma'am

In [ ]:
df=pd.DataFrame([['Red','L',15.1,'Class1'],['Green','XL',20,'Class2'],['Blue','']])

In [20]:
df1.dropna?

In [21]:
df1.fillna?

In [38]:
Imputer?